
#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщениеВТелеграм(ТекстСообщения)
	
	//++Симбирёва О.С 16.06.26
    
    ТокенБота = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить(); 
    	
    ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
    HTTPСоединение = Новый HTTPСоединение("api.telegram.org",,,,, 30, ЗащищенноеСоединение);
    
    Заголовки = Новый Соответствие();
    Заголовки.Вставить("Content-Type", "application/json");
    
    СтруктураТела = Новый Структура();
    СтруктураТела.Вставить("chat_id", ИдентификаторГруппы);
    СтруктураТела.Вставить("text", ТекстСообщения);
	
	СтрокаJSON = ОбщегоНазначения.ЗначениеВJSON(СтруктураТела);
    
    HTTPЗапрос = Новый HTTPЗапрос("/bot" + ТокенБота + "/sendMessage", Заголовки);
    HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
    
    Попытка
        Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
        
        Если Ответ.КодСостояния <> 200 Тогда
            ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
            ОписаниеОшибки = СтрШаблон("Ошибка отправки сообщения в Telegram. Код: %1. Ответ: %2", 
                Ответ.КодСостояния, ТелоОтвета);
                
            ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ОписаниеОшибки, УровеньЖурналаРегистрации.Ошибка); 
		КонецЕсли;
        
    Исключение
        ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка выполнения запроса к Telegram: " + ОписаниеОшибки, УровеньЖурналаРегистрации.Ошибка);
    КонецПопытки;
    
	//--Симбирёва О.С 16.06.26

КонецПроцедуры 

Процедура ОтправитьСообщенияИзСправочника() Экспорт
	
	//++Симбирёва О.С 17.06.26
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЭлементыНаУдаление = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
		ОтправитьСообщениеВТелеграм(ВыборкаДетальныеЗаписи.ТекстСообщения);
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		ЭлементСправочника = Ссылка.ПолучитьОбъект();
		ЭлементСправочника.УстановитьПометкуУдаления(Истина);
		ЭлементыНаУдаление.Добавить(ЭлементСправочника.Ссылка);
			
	КонецЦикла; 
	
	УдалениеПомеченныхОбъектов.УдалитьПомеченныеОбъекты(ЭлементыНаУдаление, "Стандартный");
	
	//--Симбирёва О.С 17.06.26
	
КонецПроцедуры 


#КонецОбласти