
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Сотрудники = Новый Массив;
	
	Для Каждого Строка Из Выплаты Цикл
		Если Сотрудники.Найти(Строка.Сотрудник) = Неопределено Тогда
			Сотрудники.Добавить(Строка.Сотрудник);
		КонецЕсли;
	КонецЦикла;

	СформироватьДвижения();
	
	РассчитатьВыплаты(Сотрудники);
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	Если Выплаты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Заполните табличную часть");
		Возврат;
	КонецЕсли;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Для Каждого Строка Из Выплаты Цикл
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		
	КонецЦикла;
		
КонецПроцедуры

Процедура РассчитатьВыплаты(Сотрудники)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, Сотрудник В (&СписокСотрудников)) КАК
	|		ВКМ_ВзаиморасчетыССотрудникамиОстатки";
	
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СписокСотрудников", Сотрудники);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Остатки = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Остатки.Вставить(Выборка.Сотрудник, Выборка.СуммаОстаток);
	КонецЦикла;
	
	Для Каждого Строка Из Выплаты Цикл
		
		Остаток = Остатки.Получить(Строка.Сотрудник);
		
		Если Остаток = Неопределено Тогда
			Остаток = 0;
		КонецЕсли;
		
		Если Строка.Сумма > Остаток Тогда
			
			ШаблонСообщения = "У сотрудника %1 недостаточно средств для выплаты. Доступно: %2 руб., запрошено: %3 руб.";
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Строка.Сотрудник, Остаток, Строка.Сумма));
			Возврат;
			
		КонецЕсли;
		
		Если Остаток = 0 Тогда
			
			ШаблонСообщения = "У сотрудника %1 нет суммы к выплате на дату %2";
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(ШаблонСообщения, Строка.Сотрудник, Формат(Дата, "ДФ=dd.MM.yyyy")));
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Индекс = 0;
	Для Каждого Движение Из Движения.ВКМ_ВзаиморасчетыССотрудниками Цикл
		Движение.Сумма = Выплаты[Индекс].Сумма;
		Индекс = Индекс + 1;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли