
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ВКМ_ВыполненныеКлиентуРаботы	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачалаДоговора КАК ДатаНачалаДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьРаботыСпециалиста КАК СтоимостьРаботыСпециалиста,
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту,
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ПотраченоЧасов) КАК ПотраченоЧасов
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачалаДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончанияДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьРаботыСпециалиста";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ДатаДоговора = Дата;
	ЧасыКОплатеКлиенту = 0;
	СтавкаЧасаКлиента = 0;
	ПроцентСпециалиста = ПолучитьПроцентСпециалиста(Специалист, Дата);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			ОбщегоНазначения.СообщитьПользователю("Указан неверный тип договора. Выберите договор с типом ""Абонентское обслуживание""");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ДатаДоговора > Выборка.ДатаНачалаДоговора И ДатаДоговора < Выборка.ДатаОкончанияДоговора Тогда
			
			ЧасыКОплатеКлиенту = Выборка.ЧасыКОплатеКлиенту;
			ЧасыКОплатеСотруднику = Выборка.ПотраченоЧасов;
			СтавкаЧасаКлиента = Выборка.СтоимостьРаботыСпециалиста;
			
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Дата проведения работ находится вне границ действия договора.");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ЧасыКОплатеКлиенту * СтавкаЧасаКлиента;
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
		
		Если Специалист = Неопределено Или Специалист.Пустая() Тогда
			ОбщегоНазначения.СообщитьПользователю("Не указан специалист");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Если ПроцентСпециалиста = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Для специалиста" + Специалист + "не установлен процент оплаты от работ." +
			"Документ не может быть проведен");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		СуммаКОплатеСотруднику = ЧасыКОплатеСотруднику * СтавкаЧасаКлиента * (ПроцентСпециалиста / 100);
			
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ЧасыКОплатеСотруднику;
		Движение.СуммаКОплате = СуммаКОплатеСотруднику;
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
		
	КонецЦикла;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПроведенияРаботФормат = Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yy");
	ВремяНачалаРаботФормат = Формат(ВремяНачалаРабот, "ДФ=ЧЧ:мм");
	
	Если ЭтоНовый() Тогда 
		
		ЭлементСправочника = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент(); 
		ШаблонТекста = "Создана заявка на дату: %1" + Символы.ПС + "Клиент: %2" + Символы.ПС + "Специалист: %3" + Символы.ПС + "Начало работ: %4";
		Текст = СтрШаблон(ШаблонТекста, ДатаПроведенияРаботФормат, Клиент, Специалист, ВремяНачалаРаботФормат);
		ЭлементСправочника.ТекстСообщения = Текст;
		ЭлементСправочника.Записать();
		
	Иначе 
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Специалист, ДатаПроведенияРабот, ВремяНачалаРабот");  
		
		РеквизитыИзменены = Специалист <> Реквизиты.Специалист ИЛИ ДатаПроведенияРабот <> Реквизиты.ДатаПроведенияРабот ИЛИ 
		ВремяНачалаРабот <> Реквизиты.ВремяНачалаРабот;
		
		Если РеквизитыИзменены Тогда
			ЭлементСправочника = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			ШаблонТекста = "Изменена заявка по документу %1, новые данные:" + Символы.ПС + "специалист - %2" + Символы.ПС + "дата - %3" + Символы.ПС + "начало работ - %4";
			Текст = СтрШаблон(ШаблонТекста, ЭтотОбъект, Специалист, ДатаПроведенияРаботФормат, ВремяНачалаРаботФормат);
			ЭлементСправочника.ТекстСообщения = Текст;
			ЭлементСправочника.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПроцентСпециалиста(Специалист, ДатаДляПолученияПроцента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, 0) КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
		|		ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Дата", ДатаДляПолученияПроцента);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПроцентОтРабот;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли