
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ОбработатьИСоздатьРеализации(ДатаНачала, ДатаОкончания) Экспорт

//++Симбирёва О.С 26.06.26

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорСсылка,
	|	ДоговорыКонтрагентов.Представление КАК ДоговорПредставление,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК РеализацияСсылка,
	|	ЗаказПокупателя.Ссылка КАК ЗаказСсылка
	|ПОМЕСТИТЬ ВТ_ДоговорыСДокументами
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
	|			И (РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|		ПО ДоговорыКонтрагентов.Ссылка = ЗаказПокупателя.Договор
	|			И ЗаказПокупателя.Проведен И ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
	|			И (ЗаказПокупателя.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДоговора < &ДатаОкончания
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДоговора > &ДатаНачала
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговорыСДокументами.ДоговорСсылка КАК ДоговорСсылка,
	|	ВТ_ДоговорыСДокументами.ДоговорПредставление КАК ДоговорПредставление,
	|	ВТ_ДоговорыСДокументами.Организация КАК Организация,
	|	ВТ_ДоговорыСДокументами.Контрагент КАК Контрагент,
	|	ВТ_ДоговорыСДокументами.РеализацияСсылка КАК РеализацияСсылка,
	|	ВТ_ДоговорыСДокументами.ЗаказСсылка КАК ЗаказСсылка
	|ИЗ
	|	ВТ_ДоговорыСДокументами КАК ВТ_ДоговорыСДокументами";
	
	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Договоры = Новый Массив;
	
	Пока Выборка.Следующий() Цикл   
		
		ЗаписьДоговора = Новый Структура;
		ЗаписьДоговора.Вставить("Договор", Выборка.ДоговорСсылка);
		ЗаписьДоговора.Вставить("Контрагент", Выборка.Контрагент);
		ЗаписьДоговора.Вставить("Реализация", Неопределено);
		ЗаписьДоговора.Вставить("Заказ", Неопределено); 
		ЗаписьДоговора.Вставить("СтатусДокумента", Неопределено);
		
		Если ЗначениеЗаполнено(Выборка.РеализацияСсылка) Тогда 
			ЗаписьДоговора.Реализация = Выборка.РеализацияСсылка;
			ЗаписьДоговора.СтатусДокумента = Перечисления.ВКМ_СтатусыСозданныхДокументов.ДобавленИзСуществующих;
			ЗаписьДоговора.Заказ = Неопределено;
			Договоры.Добавить(ЗаписьДоговора);
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ЗаказСсылка) Тогда
			НоваяРеализация = СоздатьРеализациюНаОснованииЗаказаПокупателя(Выборка.ЗаказСсылка, ДатаОкончания);
			ЗаписьДоговора.Реализация = НоваяРеализация.Ссылка;
			ЗаписьДоговора.Заказ = Выборка.ЗаказСсылка;
			ЗаписьДоговора.СтатусДокумента = Перечисления.ВКМ_СтатусыСозданныхДокументов.СозданПрограммно; 
		Иначе
			//@skip-check bsl-legacy-check-static-feature-access
			НовыйЗаказПокупателя = СоздатьЗаказПокупателя(Выборка.Организация, Выборка.Контрагент, Выборка.ДоговорСсылка, ДатаОкончания);
			НоваяРеализация = СоздатьРеализациюНаОснованииЗаказаПокупателя(НовыйЗаказПокупателя, ДатаОкончания);
			
			ЗаписьДоговора.Заказ = НовыйЗаказПокупателя.Ссылка;
			ЗаписьДоговора.Реализация = НоваяРеализация.Ссылка; 
			ЗаписьДоговора.СтатусДокумента = Перечисления.ВКМ_СтатусыСозданныхДокументов.СозданПрограммно;
		КонецЕсли;
		
		Договоры.Добавить(ЗаписьДоговора); 
		
	КонецЦикла;
	
	Возврат Договоры;

	
//--Симбирёва О.С 26.06.26
	
КонецФункции   

Функция СоздатьЗаказПокупателя(Организация, Контрагент, Договор, ДатаОкончания)
	
//++Симбирёва О.С 26.06.26
		
	НовыйЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	
	НовыйЗаказ.Дата = ДатаОкончания;
	НовыйЗаказ.Организация = Организация;
	НовыйЗаказ.Контрагент = Контрагент;
	НовыйЗаказ.Договор = Договор;
	НовыйЗаказ.Комментарий = "Создан автоматически для формирования акта";
		
	ВКМ_АвтозаполнениеТЧДокументовВызовСервера.ВКМ_ЗаполнитьУслугиПоДоговору(НовыйЗаказ, Договор);
	НовыйЗаказ.СуммаДокумента = НовыйЗаказ.Услуги.Итог("Сумма");
		
	НовыйЗаказ.ПроверитьЗаполнение(); 
	НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение); 
		
	Возврат НовыйЗаказ;
	
//--Симбирёва О.С 26.06.26
		
КонецФункции

Функция СоздатьРеализациюНаОснованииЗаказаПокупателя(Заказ, ДатаОкончания)
	
//++Симбирёва О.С 26.06.26
		
	НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	
	//создаём док-ты прошлым месяцем, т.к. выполненных работ в начале текущего месяца ещё нет  
	НоваяРеализация.Дата = ДатаОкончания; 
	НоваяРеализация.Комментарий = "Создан автоматически для формирования акта";
	НоваяРеализация.Заполнить(Заказ.Ссылка);
	НоваяРеализация.ВыполнитьАвтозаполнение();
	НоваяРеализация.ПроверитьЗаполнение();
	НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение);
		
	Возврат НоваяРеализация;
	
//--Симбирёва О.С 26.06.26
		
КонецФункции 
	
Функция ПечатьАктаОбОказанныхУслугах(МассивОбъектов, ОбъектыПечати) Экспорт
	
//++Симбирёва О.С 26.06.26
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктОбОказанныхУслугахОбработка";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанныхУслугах");

	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);

	ПервыйДокумент = Истина;

	Пока ДанныеДокументов.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;
		
		ВывестиЗаголовокАктаОбОказанныхУслугах(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиТаблицу(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет);
		
	КонецЦикла;

	Возврат ТабличныйДокумент;
	
//--Симбирёва О.С 26.06.26
	
КонецФункции   

Функция ПолучитьДанныеДокументов(МассивОбъектов)
	
//++Симбирёва О.С 26.06.26
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Товары,
	|	РеализацияТоваровУслуг.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Услуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
	
//--Симбирёва О.С 26.06.26
	
КонецФункции

Процедура ВывестиЗаголовокАктаОбОказанныхУслугах(ДанныеДокументов, ТабличныйДокумент, Макет)
	
//++Симбирёва О.С 26.06.26
	
	ОбластьЗаголовокДокумента = Макет.ПолучитьОбласть("Заголовок");

	ДанныеПечати = Новый Структура;
	
	ШаблонЗаголовка = "Акт об оказанных услугах %1 от %2";
	ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
		Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
	
	ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	ДанныеПечати.Вставить("Организация", ДанныеДокументов.Организация);
	ДанныеПечати.Вставить("Контрагент", ДанныеДокументов.Контрагент);
	ДанныеПечати.Вставить("Договор", ДанныеДокументов.Договор);
	
	ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
	
	ОбластьОтступ = Макет.ПолучитьОбласть("Отступ");
	ТабличныйДокумент.Вывести(ОбластьОтступ);

//--Симбирёва О.С 26.06.26
	
КонецПроцедуры

Процедура ВывестиТаблицу(ДанныеДокументов, ТабличныйДокумент, Макет)
	
//++Симбирёва О.С 26.06.26
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
	
	Пока ВыборкаУслуги.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаУслуги);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Всего", ДанныеДокументов.СуммаДокумента);
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьИтого); 
	
//--Симбирёва О.С 26.06.26
	
КонецПроцедуры

Процедура ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет)
	
//++Симбирёва О.С 26.06.26
	
	ОбластьСумма = Макет.ПолучитьОбласть("Сумма");
	СуммаПрописью = ЧислоПрописью(ДанныеДокументов.СуммаДокумента,"Л=ru_RU; ДП=Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("СуммаПрописью", СуммаПрописью);
	ОбластьСумма.Параметры.Заполнить(ДанныеПечати);
	
	ТабличныйДокумент.Вывести(ОбластьСумма);

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
//--Симбирёва О.С 26.06.26
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
