
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Сотрудники = Новый Массив;
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		Сотрудники.Добавить(Строка.Сотрудник);
	КонецЦикла;
	
	СформироватьДвижения();
	
	РассчитатьНДФЛ(Сотрудники);
	
	РассчитатьНачисленияСотрудникам();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()
	
	Для Каждого Строка Из ДополнительныеНачисления Цикл
		
		Если ТипЗнч(Строка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = Строка.ДатаНачала;
			Движение.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение.ВидРасчета = Строка.ВидРасчета;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Подразделение = Строка.Подразделение;
			Движение.Результат = Строка.Сумма;
			
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = Строка.ДатаНачала;
			Движение.ПериодДействияКонец = Строка.ДатаОкончания;
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.Подразделение = Строка.Подразделение;
			Движение.БазовыйПериодНачало = Строка.ДатаНачала;
			Движение.БазовыйПериодКонец = Строка.ДатаОкончания;
		КонецЕсли;
		
	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РассчитатьНДФЛ(Сотрудники)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ 
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.РезультатБаза КАК РезультатБаза
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(&Измерения, &Измерения, , Регистратор = &Ссылка) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления";
	
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник"); 
	Измерения.Добавить("Подразделение");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	БазаДляРасчета = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл 
		БазаДляРасчета.Вставить(Выборка.Сотрудник, Выборка.РезультатБаза);
	КонецЦикла;
	
	Для Каждого Движение Из Движения.ВКМ_Удержания Цикл 
		
		База = БазаДляРасчета.Получить(Движение.Сотрудник);
		СуммаНДФЛ = Окр(База * 0.13, 2);
		Движение.Результат = -СуммаНДФЛ; 
		
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РассчитатьНачисленияСотрудникам()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДопНачисления.Сотрудник КАК Сотрудник,
		|	ДопНачисления.СуммаДопНачислений КАК СуммаДопНачислений,
		|	ЕСТЬNULL(Удержания.СуммаУдержаний, 0) КАК СуммаУдержаний
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
		|		СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)) КАК СуммаДопНачислений
		|	ИЗ
		|		РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
		|	ГДЕ
		|		ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
		|	СГРУППИРОВАТЬ ПО
		|		ВКМ_ДополнительныеНачисления.Сотрудник
		|) КАК ДопНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ВКМ_Удержания.Сотрудник КАК Сотрудник,
		|			СУММА(ЕСТЬNULL(ВКМ_Удержания.Результат, 0)) КАК СуммаУдержаний
		|		ИЗ
		|			РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
		|		ГДЕ
		|			ВКМ_Удержания.Регистратор = &Ссылка
		|		СГРУППИРОВАТЬ ПО
		|			ВКМ_Удержания.Сотрудник
		|	) КАК Удержания
		|		ПО ДопНачисления.Сотрудник = Удержания.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//регистр ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Сотрудник = Выборка.Сотрудник;
		СуммаДопНачислений = Выборка.СуммаДопНачислений;
		СуммаУдержаний = Выборка.СуммаУдержаний;
		
		ИтоговаяСумма = СуммаДопНачислений + СуммаУдержаний;
		
		Если ИтоговаяСумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Сумма = ИтоговаяСумма;
		
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли