
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
//++Симбирёва О.С 02.07.26

	Диаграмма.Очистить();
	
	АдресВременногоХранилища = Параметры.АдресВременногоХранилища;
	ДанныеОтпусков = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Для Каждого Отпуск Из ДанныеОтпусков Цикл
		
		Точка = Диаграмма.УстановитьТочку(Отпуск.Сотрудник);
		Точка.Текст = Отпуск.Сотрудник;
		
		Серия = Диаграмма.УстановитьСерию(Отпуск.ВидРасчета);
		Серия.Текст = "Отпуск";
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Отпуск.Датаначала;
		Интервал.Конец = Отпуск.ДатаОкончания;
		
	КонецЦикла; 
	
	ЭлементШкалы = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы[0];
	ЭлементШкалы.Единица = ТипЕдиницыШкалыВремени.Месяц;          
    
    УдалитьИзВременногоХранилища(АдресВременногоХранилища);
    
 //--Симбирёва О.С 02.07.26
	
КонецПроцедуры

#КонецОбласти

