
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//++Симбирёва О.С 02.07.26
	
	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		
		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Год = Дата(Год, 1, 1);
	
		КоличествоДней = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400 + 1;
		Движение.ДниПлан = КоличествоДней;
		
	КонецЦикла;
	
	Движения.ВКМ_ПлановыеОтпуска.Записать();
	
//--Симбирёва О.С 02.07.26
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли