
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
//++Симбирёва О.С 26.06.26

	ВыполнитьОбработку();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка завершена!");
	
//--Симбирёва О.С 26.06.26

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработку()
	
//++Симбирёва О.С 26.06.26

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни);
    
//--Симбирёва О.С 26.06.26
 
КонецПроцедуры

#КонецОбласти
