

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьРеализации(Команда)
	
//++Симбирёва О.С 26.06.26
	
	ДлительнаяОперация = ПоказатьРеализацииНаСервере();
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
//--Симбирёва О.С 26.06.26
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьАктов(Команда)
	
//++Симбирёва О.С 26.06.26
	
	Если Объект.Договоры.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет данных для печати");
		Возврат;
	КонецЕсли;

	МассивРеализаций = Новый Массив;

	Для Каждого СтрокаТЧ Из Объект.Договоры Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Реализация) Тогда
			МассивРеализаций.Добавить(СтрокаТЧ.Реализация);
		КонецЕсли;
	КонецЦикла;

	Если МассивРеализаций.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет созданных реализаций для печати");
		Возврат;
	КонецЕсли;

	ТабличныйДокумент = ПечатьАктовНаСервере(МассивРеализаций);
	ТабличныйДокумент.Показать("Акт об оказанных услугах");
	
//--Симбирёва О.С 26.06.26

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоказатьРеализацииНаСервере()
	
//++Симбирёва О.С 26.06.26
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
	 "Обработки.ВКМ_МассовоеСозданиеАктов.ОбработатьИСоздатьРеализации", Объект.Период.ДатаНачала, Объект.Период.ДатаОкончания);
	
	Возврат ДлительнаяОперация;
	
//--Симбирёва О.С 26.06.26

КонецФункции

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
//++Симбирёва О.С 26.06.26
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Если ЗначениеЗаполнено(Результат.АдресРезультата) Тогда
			РезультатВыполнения = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Иначе
			РезультатВыполнения = Результат.Результат;
		КонецЕсли;        
		
		ЗаполнитьТаблицуРезультатов(РезультатВыполнения);
		
	КонецЕсли;
	
//--Симбирёва О.С 26.06.26
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьТаблицуРезультатов(ДанныеРезультата)

//++Симбирёва О.С 26.06.26 
	
	Объект.Договоры.Очистить();  
	
	Если ДанныеРезультата = Неопределено ИЛИ ДанныеРезультата.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Нет данных для отображения");
		Возврат;
	КонецЕсли;
	
	Для Каждого ЗаписьДоговора Из ДанныеРезультата Цикл  
		
		НоваяСтрока = Объект.Договоры.Добавить();
		НоваяСтрока.Договор = ЗаписьДоговора.Договор;
		НоваяСтрока.Реализация = ЗаписьДоговора.Реализация;
		НоваяСтрока.Контрагент = ЗаписьДоговора.Контрагент;
		НоваяСтрока.СтатусДокумента = ЗаписьДоговора.СтатусДокумента;
		
	КонецЦикла;
	
	Элементы.Договоры.Обновить();
	
//--Симбирёва О.С 26.06.26
	
КонецПроцедуры 

&НаСервере
Функция ПечатьАктовНаСервере(МассивРеализаций)
	
//++Симбирёва О.С 26.06.26
	
	
	ОбъектыПечати = Новый Структура;
	ТабличныйДокумент = Обработки.ВКМ_МассовоеСозданиеАктов.ПечатьАктаОбОказанныхУслугах(МассивРеализаций, ОбъектыПечати);
	
	Возврат ТабличныйДокумент;
	
//--Симбирёва О.С 26.06.26
		
КонецФункции 

#КонецОбласти











